wsdls/product_bff_search_examples/create_order.json

{
  "http-request": {
    "method": "POST",
    "path": "/ws",
    "headers": {
      "Content-Type": "text/xml",
      "SOAPAction": "/createOrder"
    },
    "body": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns=\"http://www.example.com/orders\"><soapenv:Body><OrderRequest><productid>123</productid><count>1</count></OrderRequest></soapenv:Body></soapenv:Envelope>"
  },
  "http-response": {
    "status": 200,
    "headers": {
      "Content-Type": "text/xml"
    },
    "body": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns=\"http://www.example.com/orders\"><soapenv:Body><OrderResponse><id>123</id></OrderResponse></soapenv:Body></soapenv:Envelope>"
  }
}